{
  "jobs": [
    {
      "id": 1,
      "position": "Sr. Software Engineer",
      "company": "Red Ventures",
      "year_from": 2019,
      "skills": ["React.js", "Redux.js", "Vue", "VueX", "TypeScript", "JavaScript", "Tailwind CSS", "CSS Modules", "Styled Components", "Feature Flagging", "Fastly", "Amazon Web Services (AWS)", "Terraform", "PHP", "Wordpress", "Next.js", "Nuxt.js", "Node.js", "Vite", "Webpack", "Storybook", "Storyblok",  "Launch Darkly", "A/B Testing", "Laravel", "PHPUnit", "Blade", "Twig", "REST APIs", "GraphQL", "New Relic", "Rollbar", "Jest", "Mocha", "Cypress", "HTML5", "CSS3", "SCSS", "Github Actions", "CircleCI", "Swagger API Docs", "Relational Databases", "SQL", "PostgreSQL", "MSSQL", "NoSQL", "Swagger API Docs", "Relational Databases", "Git", "GitHub", "Nx", "Lerna", "VictorOps", "Splunk On-Call", "Redis"],
      "duties": [
        "Collaborate with cross-functional teams including: Business Analysts, Product Management, SEO Analysts, Compliance and Project Management to translate high-level business requirements into actionable engineering tasks and detailed achievable goals in the development of a comprehensive product roadmap.",
        "Responsible for quickly and effectively communicating complex technical solutions either proactively or retrospectively as business need dictates, to non-technical stakeholders to ensure they are empowered to make informed decisions.",
        "Participate in the development of Junior, Associate and Mid-Level engineers via shadowing, one on ones to help them enhance their technical proficiency, documentation writing and improve their soft skills, including communication, leadership skills.",
        "Develop a wide variety of front-end web applications to meet the customer's needs. These applications range from larger monolithic systems to smaller, more customized, niche sites with backends that can be maintained by customer-employed Business Analysts, SEO Analysts and Compliance. Leveraging technologies such as React, Redux, TypeScript, Javascript, ES6, Vue, VueX, Next.js and Node.js ensuring high performance, scalability, accessibility, maintainability, observability and security using REST and GraphQL APIs.",
        "Responsible for the creation of the infrastructure utilized by various APIs. Led discussions to ascertain clients needs to determine the most appropriate technology (e.g. Terraform or AWS CloudFormation) considering security, high availability, performance, caching, authorization, authentication, versioning, logging and alerting. Leveraging technologies such as Express.js, Node.js, JavaScript (ES6), PHP, Laravel, Apollo, Go, Redis, Elasticache, Lambda, S3, EC2, ECR, RDS, DynamoDB and CloudWatch. APIs included REST and GraphQL endpoints in order to interface with linked databases, serving as proxy wrappers and scraping various websites to facilitate front-end data retrieval."
      ]
    },
    {
      "id": 2,
      "position": "Software Engineer",
      "company": "Red Ventures",
      "year_from": 2017,
      "year_to": 2019,
      "skills": ["PHP", "New Relic", "Nuxt.js", "Amazon Web Services (AWS)", "Vuex", "A/B Testing", "JavaScript", "Tailwind CSS", "Vue.js", "CSS Modules", "Node.js", "HTML5", "Swagger API Docs", "Relational Databases", "TypeScript", "WordPress", "Styled Components", "Next.js", "Blade", "React.js", "Twig", "Git", "Redux.js", "Webpack", "Jest", "Storybook", "Storyblok", "NoSQL", "GitHub", "PHPUnit", "Mocha", "SQL", "PostgreSQL", "MSSQL", "REST APIs", "Laravel", "CSS3", "SCSS"],
      "duties": [
        "Developed features for diverse websites, ranging from small healthcare marketing sites to large financial platforms. Leveraged technologies such as PHP, EJS, Hugo, HTML5, CSS3, SCSS, JS (ES6), Vue and VueX.",
        "Built React-based e-commerce carts with Redux and Webpack for a variety of industries such as internet, telecommunications and security for large Fortune 500 clients to mid-sized and smaller clients.",
        "Achieved a 600% increase in client revenue by prioritizing performance, efficiency, maintainability, accessibility, responsivity and a mobile-first mindset.",
        "Mentored and trained Junior and Associate engineers through in-person collaboration and code reviews. Emphasized not only how to implement technical solutions but also the underlying rationale. Encouraged clear communication and problem-solving skills via training sessions and via modeling expected behaviors."
      ]
    },
    {
      "id": 3,
      "position": "Web Developer",
      "company": "Netplus",
      "year_from": 2016,
      "year_to": 2017,
      "skills": ["PHP", "JavaScript", "Node.js", "HTML5", "Relational Databases", "WordPress", "React.js", "Git", "Webpack", "GitHub", "PHPUnit", "SQL", "REST APIs", "CSS3", "SCSS"],
      "duties": [
        "Developed and maintained complex websites using a diverse technology stack, including Wordpress, PHP, HTML5, CSS3, JavaScript (ES6) and build tools like Gulp and Grunt. Keeping in mind performance, accessibility, responsivity and maintainability.",
        "Led both front-end and back-end development efforts, served as a Project Manager as business need dictated and championed the adoption of mobile-first web development practices across functional teams and clients."
      ]
    },
    {
      "id": 4,
      "position": "Front End Developer",
      "company": "Brownstein Group",
      "year_from": 2015,
      "year_to": 2015,
      "type": "Short Term Contract",
      "skills": ["PHP", "JavaScript", "Node.js", "HTML5", "Relational Databases", "WordPress", "Git", "GitHub", "PHPUnit", "SQL", "PostgreSQL", "REST APIs", "CSS3", "SCSS"],
      "duties": [
        "Contributed to the development and maintenance of complex websites for a variety of clients, utilizing a diverse technology stack that included WordPress, PHP, HTML5, CSS3 and JavaScript (ES6).",
        "Collaborated closely with cross-functional teams, including Design, Copy and Project Management. Assessed existing website models and adjusted the designs to ensure the front-end adapted seamlessly to various devices."
      ]
    },
    {
      "id": 5,
      "position": "Software Engineer Intern",
      "company": "Leadnomics",
      "year_from": 2014,
      "year_to": 2014,
      "type": "Summer Internship",
      "skills": ["PHP", "HTML5", "Relational Databases", "Git", "GitHub", "PHPUnit", "SQL", "REST APIs", "CSS3"]
    },
    {
      "id": 6,
      "position": "Software Engineer",
      "company": "Freelance",
      "year_from": 2008,
      "year_to": 2017,
      "skills": ["PHP", "Vuex", "JavaScript", "Vue.js", "CSS Modules", "Node.js", "HTML5", "Relational Databases", "TypeScript", "WordPress", "Styled Components", "Next.js", "Git", "Webpack", "Jest", "NoSQL", "GitHub", "PHPUnit", "Mocha", "SQL", "PostgreSQL", "REST APIs", "CSS3", "SCSS"],
      "duties": [
        "Developed a variety of complex websites for clients using CodeIgniter, PHP, HTML5, CSS3 and JavaScript. Led end-to-end development, including database setup, REST API architecture, design and front-end implementation. Notably, created a custom CMS with features like commenting, replies and CRUD operations for posts.",
        "Designed and implemented an orphanage website system, allowing administrators to upload adoption-related information (including photos, videos, biographies and sibling details). Additionally, facilitated effective communication with clients, translating their needs into actionable business requirements and maintaining regular progress updates.",
        "Designed and implemented a custom reporting system that consolidates data from Twitter, Facebook and the MailChimp API. This system offers valuable insights into a business’s online presence and leveraged technologies such as PHP, HTML, CSS and JavaScript."
      ]
    }
  ]
}